{
    "nodes": 

[ { "bodyText": "{📢 announcements} Colorgrave announced April Grove, a game where your new job is a forester in a mystic and peaceful wood. Wishlist it on Steam!" }, { "bodyText": "{📢 announcements} The Nintendo Switch 2 was announced, and will be releasing June 5th. We look forward to seeing what innovations our developers can create with the new hardware!" }, { "bodyText": "{🎮 releases} AzeTron released PokeDraft, a Pokemon CPU that is designed to challenge the player" }, { "bodyText": "{🎮 releases} Michael Hicks’s Dissent on Mars was released! Please support the game and give it a review too!" }, { "bodyText": "{🎮 releases} DoodleDupe released Battle House for their Game Design Senior Show!" }, { "bodyText": "{🎮 releases} After years of development, Butterscotch Shenanigans' Crashlands 2 has landed on Steam and mobile!" }, { "bodyText": "{📅 events} STLGameDev’s monthly Gamedev Social is on May 8th at 7pm at Dirty20 Bar. Hang out with fellow creators. Chat about making, playing, and admiring games, share game ideas, and get inspired! Make friends and find collaborators. Also, paint a miniature Plorp!" }, { "bodyText": "{📚 resources} The full book on Game Programming Patterns is available online for free!" }, { "bodyText": "{📅 events} Gateway Game Jam and Creative Lab are hosting the Pixel and Page Game Jam for ages 12-18 at the St. Louis County Library on May 3rd at 11am. Participants will team up with volunteer first responders, tech industry professionals, and game developers to create their own video game using the program, Bloxels." }, { "bodyText": "{📅 events} The STLGameDev will be hosting an extended week-long Spring Jam! The theme will be revealed on Twitch at 7pm CDT on May 23rd, with a showcase on June 1st at 7:00 pm CDT to close out the jam." }, { "bodyText": "{📖 articles} Read up on the latest events involved with our community in our latest blog post!" }, { "bodyText": "{📽 videos} The Professor explains the nightmare when licensing an IP for your game goes wrong in his latest video." }, { "bodyText": "{🎼 releases} Lazarus D. Richardson has released the last decade of his music on Spotify and Bandcamp! It spans a many genres, from goofy witch themes to microtonal orchestras!" }, { "bodyText": "{📢 announcements} Kris Truitt's Mansion of a Million Monsters now has a steam page! Add it to your wishlist!" }, { "bodyText": "{!header} We appologize for the previous RoundUp Issue's Technical problems." } ]

}
